; domain
(define (domain logistics)
  (:requirements :strips :typing)
  (:types
    physobj
    object vehicle - physobj
    truck airplane - vehicle
    location - physobj
    airport - location
    city
  )
  (:predicates
    (loc ?l - location ?c - city)
    (at ?x - physobj ?l - location)
    (in ?p - object ?v - vehicle)
  )

  (:action load
    :parameters (?o - object ?v - vehicle ?l - location)
    :precondition (and (at ?v ?l) (at ?o ?l))
    :effect (and (in ?o ?v) (not (at ?o ?l)))
  )

  (:action unload
    :parameters (?o - object ?v - vehicle ?l - location)
    :precondition (and (in ?o ?v) (at ?v ?l))
    :effect (and (at ?o ?l) (not (in ?o ?v)))
  )

  (:action drive
    :parameters (?t - truck ?from - location ?to - location ?c - city)
    :precondition (and (at ?t ?from) (loc ?from ?c) (loc ?to ?c))
    :effect (and (at ?t ?to) (not (at ?t ?from)))
  )

  (:action fly
    :parameters (?p - airplane ?from - airport ?to - airport)
    :precondition (at ?p ?from)
    :effect (and (at ?p ?to) (not (at ?p ?from)))
  )
)

; problem
(define (problem logistics-5)
  (:domain logistics)
  (:objects
    pkg1 pkg2 pkg3 pkg4 - object
    truck1 truck2 truck3 - truck
    plane1 plane2 - airplane
    loc1 loc2 loc3 - location
    airport1 airport2 airport3 - airport
    city1 city2 city3 - city
  )
  (:init
    (loc loc1 city1)
    (loc airport1 city1)
    (loc loc2 city2)
    (loc airport2 city2)
    (loc loc3 city3)
    (loc airport3 city3)
    (at truck1 loc1)
    (at truck2 loc2)
    (at truck3 loc3)
    (at plane1 airport1)
    (at plane2 airport2)
    (at pkg1 loc1)
    (at pkg2 airport1)
    (at pkg3 loc2)
    (at pkg4 airport3)
  )
  (:goal (and (at pkg1 loc3) (at pkg2 airport3) 
               (at pkg3 loc1) (at pkg4 airport2)))
)

; plan
1. (load pkg3 truck2 loc2)
   deleted: (at pkg3 loc2)
   added: (in pkg3 truck2)
   goals met: 0 of 4
2. (drive truck2 loc2 airport2 city2)
   deleted: (at truck2 loc2)
   added: (at truck2 airport2)
   goals met: 0 of 4
3. (unload pkg3 truck2 airport2)
   deleted: (in pkg3 truck2)
   added: (at pkg3 airport2)
   goals met: 0 of 4
4. (load pkg1 truck1 loc1)
   deleted: (at pkg1 loc1)
   added: (in pkg1 truck1)
   goals met: 0 of 4
5. (load pkg2 plane1 airport1)
   deleted: (at pkg2 airport1)
   added: (in pkg2 plane1)
   goals met: 0 of 4
6. (drive truck1 loc1 airport1 city1)
   deleted: (at truck1 loc1)
   added: (at truck1 airport1)
   goals met: 0 of 4
7. (unload pkg1 truck1 airport1)
   deleted: (in pkg1 truck1)
   added: (at pkg1 airport1)
   goals met: 0 of 4
8. (load pkg1 plane1 airport1)
   deleted: (at pkg1 airport1)
   added: (in pkg1 plane1)
   goals met: 0 of 4
9. (fly plane1 airport1 airport3)
   deleted: (at plane1 airport1)
   added: (at plane1 airport3)
   goals met: 0 of 4
10. (load pkg4 plane1 airport3)
   deleted: (at pkg4 airport3)
   added: (in pkg4 plane1)
   goals met: 0 of 4
11. (unload pkg2 plane1 airport3)
   deleted: (in pkg2 plane1)
   added: (at pkg2 airport3)
   goals met: 1 of 4
12. (unload pkg1 plane1 airport3)
   deleted: (in pkg1 plane1)
   added: (at pkg1 airport3)
   goals met: 1 of 4
13. (load pkg3 plane2 airport2)
   deleted: (at pkg3 airport2)
   added: (in pkg3 plane2)
   goals met: 1 of 4
14. (fly plane2 airport2 airport1)
   deleted: (at plane2 airport2)
   added: (at plane2 airport1)
   goals met: 1 of 4
15. (unload pkg3 plane2 airport1)
   deleted: (in pkg3 plane2)
   added: (at pkg3 airport1)
   goals met: 1 of 4
16. (load pkg3 truck1 airport1)
   deleted: (at pkg3 airport1)
   added: (in pkg3 truck1)
   goals met: 1 of 4
17. (drive truck1 airport1 loc1 city1)
   deleted: (at truck1 airport1)
   added: (at truck1 loc1)
   goals met: 1 of 4
18. (unload pkg3 truck1 loc1)
   deleted: (in pkg3 truck1)
   added: (at pkg3 loc1)
   goals met: 2 of 4
19. (fly plane1 airport3 airport2)
   deleted: (at plane1 airport3)
   added: (at plane1 airport2)
   goals met: 2 of 4
20. (unload pkg4 plane1 airport2)
   deleted: (in pkg4 plane1)
   added: (at pkg4 airport2)
   goals met: 3 of 4
21. (drive truck3 loc3 airport3 city3)
   deleted: (at truck3 loc3)
   added: (at truck3 airport3)
   goals met: 3 of 4
22. (load pkg1 truck3 airport3)
   deleted: (at pkg1 airport3)
   added: (in pkg1 truck3)
   goals met: 3 of 4
23. (drive truck3 airport3 loc3 city3)
   deleted: (at truck3 airport3)
   added: (at truck3 loc3)
   goals met: 3 of 4
24. (unload pkg1 truck3 loc3)
   deleted: (in pkg1 truck3)
   added: (at pkg1 loc3)
   goals met: 4 of 4
